# Core CLI dependencies used by the tracked shell/editor setup.
tap "oven-sh/bun"
tap "nikitabobko/tap"

brew "atuin"
brew "awscli"
brew "bat"
brew "bun"
brew "coreutils"
brew "docker"
brew "eza"
brew "fzf"
brew "gh"
brew "git-delta"
brew "git-lfs"
brew "helm"
brew "httpie"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "neovim"
brew "ngrep"
brew "nvm"
brew "peco"
brew "pnpm"
brew "ripgrep"
brew "sheldon"
brew "starship"
brew "tre-command"
brew "tree-sitter"
brew "wget"
brew "yq"
brew "zoxide"

# GUI apps with tracked config in this repo.
cask "ghostty"
cask "karabiner-elements"
cask "nikitabobko/tap/aerospace"
cask "visual-studio-code"
cask "cmux"
cask "orbstack"
cask "raycast"
