aaron-bond.better-comments
amodio.toggle-excluded-files
anotherglitchinthematrix.monochrome
antfu.file-nesting
anthropic.claude-code
astro-build.astro-vscode
atomiks.moonlight
beardedbear.beardedicons
beardedbear.beardedtheme
biomejs.biome
bmewburn.vscode-intelephense-client
bradlc.vscode-tailwindcss
capaj.vscode-exports-autocomplete
catppuccin.catppuccin-vsc
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
daltonmenezes.aura-theme
dbaeumer.vscode-eslint
denoland.vscode-deno
docker.docker
dracula-theme.theme-dracula
drcika.apc-extension
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
formulahendry.auto-rename-tag
gera2ld.markmap-vscode
github.copilot-chat
github.vscode-github-actions
golang.go
hashicorp.terraform
hideoo.create
kamikillerto.vscode-colorize
leeh.vcl-extension
liviuschera.noctis
mariusalchimavicius.json-to-ts
meganrogge.template-string-converter
mrmlnc.vscode-scss
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-vscode.vscode-typescript-next
ms-vsliveshare.vsliveshare
mvllow.rose-pine
onecentlin.laravel-blade
orta.vscode-jest
orta.vscode-twoslash-queries
oven.bun-vscode
oxc.oxc-vscode
plibither8.remove-comments
quicktype.quicktype
raunofreiberg.vesper
rust-lang.rust-analyzer
shakram02.bash-beautify
shopify.theme-check-vscode
shufo.vscode-blade-formatter
stripe.markdoc-language-support
styled-components.vscode-styled-components
svelte.svelte-vscode
tamasfe.even-better-toml
unifiedjs.vscode-mdx
vercel.turbo-vsc
vitest.explorer
wicked-labs.sequoia
wix.vscode-import-cost
wmaurer.change-case
xabikos.reactsnippets
xdebug.php-debug
yoavbls.pretty-ts-errors
